I just finished a proof of concept, updating the resource definition and it seems to be working now after updating the expected type associated with the splunk port 
```
  # module.auth0_tenant.auth0_log_stream.splunk is tainted, so must be replaced
-/+ resource "auth0_log_stream" "splunk" {
      - filters = [] -> null
      ~ id      = "<redacted>" -> (known after apply)
        name    = "<redacted>"
        # (2 unchanged attributes hidden)

      ~ sink {
          + aws_partner_event_source = (known after apply)
          + azure_partner_topic      = (known after apply)
          + http_content_format      = (known after apply)
          - http_custom_headers      = [] -> null
            # (4 unchanged attributes hidden)
        }
    }
    ```
    
    I'll have an PR here shortly for this